app/views/users/index.html.erb

    <td><%= user.email %></td>
    <td><%= user.watches.count %></td>
---
SELECT COUNT(*) FROM "watches" WHERE "watches"."user_id" = 4