app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "e_password", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 26 Aug 2012 05:00:54 UTC +00:00], ["e_password", ""], ["email", "steef@yahoo.com"], ["name", "Stephen Jacobson"], ["updated_at", Sun, 26 Aug 2012 05:00:54 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "users" SET "name" = 'Stephen Jacobson', "e_password" = '', "updated_at" = '2012-08-26 17:24:04.740468' WHERE "users"."id" = 4
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])