app/controllers/watches_controller.rb

  def index
    @watches = Watch.all
---
SELECT "watches".* FROM "watches"

  def show
    @watch = Watch.find(params[:id])
---
SELECT "watches".* FROM "watches" WHERE "watches"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @watch = current_user.watches.new(params[:watch])
    respond_to do |format|
      if @watch.save
---
INSERT INTO "watches" ("bird", "boro", "created_at", "location", "notes", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @watch = Watch.find(params[:id])
    @watch.destroy
---
SELECT "watches".* FROM "watches" WHERE "watches"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "watches" WHERE "watches"."id" = ?  [["id", 3]]